{
    "ingredient_name": [
        "Paneer (cottage cheese)",
        "Bell peppers (capsicum)",
        "Onion",
        "Tomatoes",
        "Ginger",
        "Garlic",
        "Dry red chilies",
        "Coriander seeds",
        "Cumin seeds",
        "Turmeric powder",
        "Red chili powder",
        "Garam masala",
        "Kasuri methi (dried fenugreek leaves)",
        "Fresh cream",
        "Oil",
        "Salt",
        "Fresh coriander leaves",
        "Noodles (Hakka or instant)",
        "Vegetable oil",
        "Spring onions",
        "Carrot",
        "Capsicum",
        "Cabbage",
        "Soy sauce",
        "Chili sauce",
        "Vinegar",
        "Black pepper",
        "Eggs (optional)",
        "Sesame seeds (optional)",
        "Cheese (grated)",
        "Tomato ketchup",
        "Mixed herbs (oregano, basil)",
        "Fresh parsley (optional)",
        "Pasta (penne/spaghetti)",
        "Olive oil"
    ],
    "ingredient_desc": [
        "Soft, fluffy cubes of paneer that add a creamy texture and protein to the dish.",
        "Fresh, vibrant capsicum pieces that provide a crunchy texture and sweet flavor.",
        "Sliced onions add a sweet and savory base to the dish when cooked to golden perfection.",
        "Pureed tomatoes form a rich, tangy base for the kadhai paneer gravy.",
        "Finely chopped ginger adds a warm, aromatic flavor to the dish.",
        "Minced garlic enhances the overall depth and flavor of the dish.",
        "Spicy and smoky red chilies bring heat and authenticity to the recipe.",
        "Roasted and crushed coriander seeds add a nutty, citrusy flavor.",
        "Earthy and aromatic cumin seeds enhance the base of the dish.",
        "A vibrant spice that adds color and earthy notes to the dish.",
        "Adds a bold, spicy kick and enhances the vibrant red color of the gravy.",
        "A blend of spices that brings warmth and depth to the kadhai paneer.",
        "Adds a unique, slightly bitter yet aromatic flavor to the dish.",
        "Optional ingredient for a creamy and rich texture in the gravy.",
        "Used to sauté and enhance the flavors of the spices and vegetables.",
        "Essential to balance and enhance all the flavors in the dish.",
        "A refreshing garnish that adds a burst of fresh aroma and color.",
        "The primary ingredient, boiled to the right consistency.",
        "Used for stir-frying and enhancing the overall flavor.",
        "Adds a fresh, mild onion flavor to the noodles.",
        "Thinly sliced carrot adds crunch and color.",
        "Adds a sweet and crunchy texture to the dish.",
        "Shredded cabbage adds a fresh, crisp bite to the noodles.",
        "Adds umami and a salty depth to the dish.",
        "Provides a spicy kick and enhances flavor.",
        "Adds a tangy brightness to balance the flavors.",
        "Adds mild heat and seasoning to the noodles.",
        "Scrambled eggs add protein and a soft texture to the dish.",
        "Garnish for a nutty crunch and visual appeal.",
        "Melts into the pasta, adding creaminess and richness.",
        "Adds a hint of sweetness and extra tang to the sauce.",
        "Aromatic herbs that add an Italian flavor to the pasta.",
        "Used as a garnish for a refreshing and aromatic finish.",
        "The main ingredient, boiled to perfection, forming the base of the dish.",
        "Adds a smooth texture and enhances the flavor of the sauce."
    ],
    "price": [
        60,
        30,
        15,
        20,
        10,
        10,
        5,
        5,
        5,
        5,
        5,
        10,
        10,
        20,
        10,
        5,
        5,
        40,
        15,
        20,
        15,
        15,
        10,
        10,
        10,
        5,
        5,
        30,
        10,
        25,
        15,
        10,
        10,
        50,
        20
    ]
}